import React from "react";
import "../item-menu/item-menu.css";
import { ItemMenu } from "../item-menu/item-menu";
import Soup1 from "../images/Menu/soup/suop1.png"

const SoupMenu = () => {
    const soups = [
        {
            id: 1,
            name: "куксу",
            description: "холодный куксу по-китайски",
            photo: `${Soup1}`,
            price: 220,
            weight: 330
        },
        {
            id: 2,
            name: "Грибной крем-суп",
            ingredients: [
                "шампиньоны",
                "лук",
                "сметана",
                "перепелиные яйца",
                "соль",
                "перец"
            ],
            description: "Ароматный грибной крем-суп с нежной текстурой и насыщенным вкусом. Идеальное сочетание свежих шампиньонов и сливок.",
            photo: "https://smaylovich.ru/upload/iblock/386/38685c29e962feb6ff89498fda495b3b.jpeg",
            price: 6.99
        },
        {
            id: 3,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 4,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 5,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 6,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 7,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 8,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 9,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 10,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 11,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        },
        {
            id: 12,
            name: "Томатный суп",
            ingredients: [
                "помидоры",
                "лук",
                "морковь",
                "чеснок",
                "базилик",
                "соль",
                "сахар"
            ],
            description: "Ароматный томатный суп с насыщенным вкусом и легкой кислинкой. Идеальное сочетание спелых помидоров и свежих трав.",
            photo: "https://cdn.bahroma1.ru/goods/tom_yam_nov.jpg",
            price: 4.99
        }
    ];

  return (
    <div className="item-menu">
      <h1>СУПЫ</h1>
      <ItemMenu items={soups} />
    </div>
  );
};

export default SoupMenu;




